In [8]:
import pandas as pd

In [9]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [11]:
df.loc["a", "A"]

10

In [12]:
df.loc["b":, "A"]

b    14
c    18
Name: A, dtype: int32

In [13]:
df.loc["a", :]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [14]:
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [15]:
df.loc[df.A > 10, :]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [16]:
df.loc["a", :]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [17]:
df[:1]

    A   B   C   D
a  10  11  12  13

In [20]:
df.loc[:, df.loc["a", :] <= 11]

    A   B
a  10  11
b  14  15
c  18  19

In [26]:
def find_rows(df):
    return df.A > 12

In [27]:
find_rows(df)

a    False
b     True
c     True
Name: A, dtype: bool

In [28]:
df.loc[find_rows(df), ["C"]]

    C
b  16
c  20

In [31]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [32]:
df.loc["e"] = [90, 91, 92, 93]
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21
e  90  91  92  93

In [33]:
df.iloc[0,1]

11

In [34]:
df.iloc[:2,2]

a    12
b    16
Name: C, dtype: int64

In [35]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int64

In [36]:
df.iloc[-1]

A    90
B    91
C    92
D    93
Name: e, dtype: int64

In [37]:
df.iloc[-1] = df.iloc[-1] * 2
df

     A    B    C    D
a   10   11   12   13
b   14   15   16   17
c   18   19   20   21
e  180  182  184  186

In [65]:
ac = pd.DataFrame(np.arange(1, 26).reshape(5, 5),
                  index=["a", "b", "c", "d", "e"],
                  columns=["A", "B", "C", "D", "E"])
ac

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25

In [66]:
df.loc["e", "E"]

25

In [68]:
df.loc["e":, "E"]

e    25
Name: E, dtype: int32

In [69]:
df.loc[:]

    A   B   C   D   E
a   1   2   3   4   5
b   6   7   8   9  10
c  11  12  13  14  15
d  16  17  18  19  20
e  21  22  23  24  25